---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceRotation
source: html/87d195c8-6a51-0f61-3bbc-c9f7d54dc567.htm
---
# Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceRotation Property

The property labeled "Rotation" from the "AdvancedMetal" schema.

## Syntax (C#)
```csharp
public static string SurfaceRotation { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.